УТ/src/Documents/АУ_ГарантийныйТалон/АУ_ГарантийныйТалон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АУ_ГарантийныйТалон</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УТ/src/Documents/АУ_ГарантийныйТалон/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_DOC_ГарантийныйТалон";
	КомандаПечати.Представление = НСтр("ru = 'Гарантийный талон (Аурум)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_DOC_ГарантийныйТалон");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		МакетДокумента = Документы.АУ_ГарантийныйТалон.ПолучитьМакет("ПФ_DOC_ГарантийныйТалон");
		Шаблон = НСтр("ru = 'Гарантийный талон - [Организация] №[Номер]'");		
		Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
		
		ОфисныеДокументы = ПечатьДокумента(МассивОбъектов, Макет, Шаблон);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Гарантийный талон (Аурум)'");
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
		
	КонецЕсли;
			
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

Функция ПечатьДокумента(МассивОбъектов, Макет, Шаблон)
	
	ОфисныеДокументы = Новый Соответствие;
		
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка", "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Строка", "СтрокаТаблицы");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал", "Общая");
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	             |	РеализацияТоваровУслуг.Дата КАК Дата,
	             |	РеализацияТоваровУслуг.Номер КАК Номер,
	             |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	             |	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	             |	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	             |	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
	             |	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	             |	РеализацияТоваровУслуг.Договор КАК Договор,
	             |	РеализацияТоваровУслуг.Договор.Номер КАК ДоговорНомер,
	             |	РеализацияТоваровУслуг.Договор.Дата КАК ДоговорДата,
	             |	АУ_ГарантийныйТалон.Номенклатура КАК Номенклатура,
	             |	АУ_ГарантийныйТалон.Характеристика КАК Характеристика,
	             |	АУ_ГарантийныйТалон.Серия КАК Серия,
	             |	АУ_ГарантийныйТалон.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	             |	АУ_ГарантийныйТалон.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	             |	АУ_ГарантийныйТалон.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	             |	АУ_ГарантийныйТалон.ГарантийныйСрок КАК ГарантийныйСрок,
	             |	АУ_ГарантийныйТалон.СерийныйНомер КАК СерийныйНомер,
	             |	АУ_ГарантийныйТалон.Номенклатура.Марка КАК НоменклатураМарка,
	             |	АУ_ГарантийныйТалон.Номенклатура.Производитель КАК НоменклатураПроизводитель,
	             |	АУ_ГарантийныйТалон.Номенклатура.ПроизводительИмпортерКонтрагент КАК НоменклатураПроизводительИмпортерКонтрагент,
	             |	РеализацияТоваровУслуг.Грузополучатель.НаименованиеПолное КАК ГрузополучательНаименованиеПолное,
	             |	РеализацияТоваровУслуг.Валюта КАК Валюта,
	             |	РеализацияТоваровУслуг.Организация КАК Организация,
	             |	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
	             |ИЗ
	             |	Документ.АУ_ГарантийныйТалон КАК АУ_ГарантийныйТалон
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ПО АУ_ГарантийныйТалон.Реализация = РеализацияТоваровУслуг.Ссылка
	             |ГДЕ
	             |	АУ_ГарантийныйТалон.Ссылка В(&Ссылка)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	             |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	             |	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	             |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	             |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	             |	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	             |	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	ЗаказКлиентаТовары.Количество КАК Количество,
	             |	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
	             |	ЗаказКлиентаТовары.Цена КАК Цена,
	             |	ЗаказКлиентаТовары.Сумма КАК Сумма,
	             |	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	             |	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	             |	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	             |	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	             |	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	             |	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	             |	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	             |	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
	             |	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	             |	ЗаказКлиентаТовары.Отменено КАК Отменено,
	             |	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
	             |	ЗаказКлиентаТовары.Склад КАК Склад,
	             |	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
	             |	ЗаказКлиентаТовары.Содержание КАК Содержание,
	             |	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	             |	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	             |	ЗаказКлиентаТовары.Серия КАК Серия,
	             |	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
	             |	ЗаказКлиентаТовары.Обособленно КАК Обособленно,
	             |	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	             |	ЗаказКлиентаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	             |	ЗаказКлиентаТовары.Подразделение КАК Подразделение,
	             |	ЗаказКлиентаТовары.НоменклатураПартнера КАК НоменклатураПартнера,
	             |	ЗаказКлиентаТовары.АУ_НаименованиеДляПечати КАК АУ_НаименованиеДляПечати,
	             |	ЗаказКлиентаТовары.АУ_НаименованиеЕдиницыИзмерения КАК АУ_НаименованиеЕдиницыИзмерения,
	             |	ЗаказКлиентаТовары.АУ_ЗаказПоставщику КАК АУ_ЗаказПоставщику,
	             |	ЗаказКлиентаТовары.АУ_КодСтроки КАК АУ_КодСтроки,
	             |	ЗаказКлиентаТовары.АУ_Объект КАК АУ_Объект,
	             |	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	             |	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	             |	ЗаказКлиентаТовары.СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте,
	             |	ЗаказКлиентаТовары.АУ_ПлановыйВход КАК АУ_ПлановыйВход,
	             |	ЗаказКлиентаТовары.АУ_Шифр КАК АУ_Шифр,
	             |	ЗаказКлиентаТовары.АУ_ДатаВводаВЭсплуатацию КАК АУ_ДатаВводаВЭсплуатацию,
	             |	ЗаказКлиентаТовары.АУ_НазваниеПоГосПрограмме КАК АУ_НазваниеПоГосПрограмме
	             |ИЗ
	             |	Документ.АУ_ГарантийныйТалон КАК АУ_ГарантийныйТалон
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ПО АУ_ГарантийныйТалон.Реализация = РеализацияТоваровУслуг.Ссылка
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	             |		ПО (РеализацияТоваровУслуг.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
	             |ГДЕ
	             |	АУ_ГарантийныйТалон.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент = Пакет[0].Выбрать();
	ДанныеЗаказов = Пакет[1].Выгрузить();
				 
	Пока ВыборкаДокумент.Следующий() Цикл
		
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
		
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат ОфисныеДокументы;
		КонецЕсли;
		
		ДанныеПечати=Новый Структура;
		ДанныеПечати.Вставить("ДокументНомер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокумент.Номер));
		ДанныеПечати.Вставить("ДокументДата", Формат(ВыборкаДокумент.Дата, "ДФ=dd.MM.yyyy"));
		ДанныеПечати.Вставить("ДоговорНомер", ВыборкаДокумент.ДоговорНомер);
		ДанныеПечати.Вставить("ДоговорДата", Формат(ВыборкаДокумент.ДоговорДата, "ДФ=dd.MM.yyyy"));
		ДанныеПечати.Вставить("ДоговорДатаПрописью", Формат(ВыборкаДокумент.ДоговорДата, "ДФ='дд ММММ гггг'"));
		ДанныеПечати.Вставить("Грузополучатель", СокрЛП(ВыборкаДокумент.ГрузополучательНаименованиеПолное));
		ДанныеПечати.Вставить("АдресДоставки", СокрЛП(ВыборкаДокумент.АдресДоставки));
		ДанныеПечати.Вставить("СуммаИтого", Формат(ВыборкаДокумент.СуммаДокумента, "ЧДЦ=2"));
		
		КодыДоговора = ПолучитьКодыДоговора(ВыборкаДокумент.Договор);
		
		//ДатаВвода = Дата(1, 1, 1);
		//Выборка = ВыборкаДокумент.Товары.Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	
		//	НайденныеСтроки = ДанныеЗаказов.НайтиСтроки(Новый Структура("Ссылка,Номенклатура,Характеристика,КодСтроки", ВыборкаДокумент.ЗаказКлиента, Выборка.Номенклатура, Выборка.Характеристика, Выборка.КодСтроки));
		//	Если НайденныеСтроки.Количество() > 0 Тогда
		//		ДатаВвода = Макс(ДатаВвода, НайденныеСтроки[0].АУ_ДатаВводаВЭсплуатацию);
		//	КонецЕсли;
		//	
		//КонецЦикла;
		ДанныеПечати.Вставить("ДатаВвода", Формат(ВыборкаДокумент.ДатаВводаВЭксплуатацию, "ДФ=dd.MM.yyyy"));
			
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеПечати);
		
		//ВидыЗапасов = ВыборкаДокумент.ВидыЗапасов.Выгрузить();
		//
		//Сумма = 0;
		//СуммаНДС = 0;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("НомерПП", "1");
		
		ДанныеСтроки.Вставить("Номенклатура", ВыборкаДокумент.НоменклатураНаименованиеПолное);
		ДанныеСтроки.Вставить("НоменклатураСерийныйНомер", "");
		ДанныеСтроки.Вставить("НоменклатураПроизводитель", ВыборкаДокумент.НоменклатураПроизводительИмпортерКонтрагент);
		ДанныеСтроки.Вставить("НоменклатураСтранаПроисхождения", "");
		ДанныеСтроки.Вставить("КодКОЗ", СтрШаблон("%1 %2 %3 %4", КодыДоговора.КОЗ, КодыДоговора.КОЗ2, КодыДоговора.ОКПД2, КодыДоговора.КТРУ));
		
		//стрВидыЗапасов = ВидыЗапасов.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Выборка.ИдентификаторСтроки));
		//Если стрВидыЗапасов.Количество() > 0 Тогда
		//	стрВидыЗапасов = стрВидыЗапасов[0];
		//	Если ЗначениеЗаполнено(стрВидыЗапасов.НомерГТД) Тогда
		//		ДанныеСтроки.Вставить("НоменклатураСтранаПроисхождения", СокрЛП(стрВидыЗапасов.НомерГТД.СтранаПроисхождения.НаименованиеПолное));
		//	КонецЕсли;
		//КонецЕсли;
		
		ДанныеСтроки.Вставить("Единица", СокрЛП(ВыборкаДокумент.НоменклатураЕдиницаИзмерения));
		ДанныеСтроки.Вставить("Количество", "1");
		
		ДанныеСтроки.Вставить("НоменклатураРУ", ПолучитьРУПоНоменклатуре(ВыборкаДокумент.Номенклатура));
		
		ДанныеСтроки.Вставить("ДокументНомер", ДанныеПечати.ДокументНомер);
		ДанныеСтроки.Вставить("ДокументДата", ДанныеПечати.ДокументДата);
		
		НайденныеСтроки = ДанныеЗаказов.НайтиСтроки(Новый Структура("Ссылка,Номенклатура,Характеристика", ВыборкаДокумент.ЗаказКлиента, ВыборкаДокумент.Номенклатура, ВыборкаДокумент.Характеристика));
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НаименованиеПоГК = НайденныеСтроки[0].АУ_НазваниеПоГосПрограмме;
			ДатаВвода = НайденныеСтроки[0].АУ_ДатаВводаВЭсплуатацию;
			
			Если ЗначениеЗаполнено(ДатаВвода) Тогда
				ДанныеСтроки.Вставить("ДатаВвода", Формат(ДатаВвода, "ДФ=dd.MM.yyyy"));
			Иначе
				ДанныеСтроки.Вставить("ДатаВвода", "");
			КонецЕсли;
			
			ДанныеСтроки.Вставить("НаименованиеПоГК", НаименованиеПоГК);
			
		Иначе
			
			ДанныеСтроки.Вставить("ДатаВвода", "");
			ДанныеСтроки.Вставить("НаименованиеПоГК", НаименованиеПоГК);
			
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Строка"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеСтроки);
		
		ДанныеПечати.Вставить("КоличествоСтрок", 1);
		
		Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеПечати);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
		
		ЗначенияРеквизитовДокумента = Новый Структура("Организация,Номер", ВыборкаДокумент.Организация, ДанныеПечати.ДокументНомер);
		ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовДокумента);
		
		ОфисныеДокументы.Вставить(АдресХранилищаПечатнойФормы, ИмяДокумента);
			
	КонецЦикла;
	
	УправлениеПечатью.ОчиститьСсылки(Макет);
	
	Возврат ОфисныеДокументы;
	
КонецФункции

Функция ПолучитьРУПоНоменклатуре(Номенклатура)
	
	НомерРУ = УправлениеСвойствами.ЗначениеСвойства(Номенклатура, "НомерРУ_73fb8c2093594a688f4375e5da1fbeb2");
	ДатаРУ = УправлениеСвойствами.ЗначениеСвойства(Номенклатура, "ДатаРУ_d1a7ea9a3c854cafa15ee29dbd15988b");
	
	Если ЗначениеЗаполнено(НомерРУ) И ЗначениеЗаполнено(ДатаРУ) Тогда
		Возврат СтрШаблон("РУ №%1 от %2", НомерРУ, Формат(ДатаРУ, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьКодыДоговора(Договор)
	
	Результат = Новый Структура();
	Результат.Вставить("КОЗ", СокрЛП(УправлениеСвойствами.ЗначениеСвойства(Договор, "КодКОЗ_a5554bd895784b1fa674be13725408d2")));
	Результат.Вставить("КОЗ2", СокрЛП(УправлениеСвойствами.ЗначениеСвойства(Договор, "КодКОЗ2_17e0bc7fc3c34bac833c74a653b25e9d")));
	Результат.Вставить("ОКПД2", СокрЛП(УправлениеСвойствами.ЗначениеСвойства(Договор, "ОКПД2_0b118c82e9814c128deda5ec2eb766d1")));
	Результат.Вставить("КТРУ", СокрЛП(УправлениеСвойствами.ЗначениеСвойства(Договор, "КТРУ_64025c31f2bf42659c6cfc0c389a17f0")));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
